// Задача Имеется список чисел. Создайте список, в который попадают числа, описывающие максимальную возрастающую последовательность.
// Порядок элементов менять нельзя. Никаким образом даже создать временный массив. Одна цифра не считается возвращающейся последовательностью
// Подсказка, сначала нужно найти минимальную цифру, подсказка если цифр 10 то максимум 5 пар.
// Пример: [1, 5, 2, 3, 4, 6, 1, 7] => [1, 7] [1, 5, 2, 3, 4, 1, 7, 8 , 15 , 1 ] => [1, 5] [1, 5, 3, 4, 1, 7, 8 , 15 , 1 ] => [3, 5]

